app/views/users/show.html.erb

            </h5>
            <p class="card-text"><%= pluralize(user.articles.count, "Blog") %></p>
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 2