app/controllers/articles_controller.rb

  def index

    @articles =current_user.articles .paginate(page: params[:page], per_page: 3)
---
SELECT `articles`.* FROM `articles`
SELECT COUNT(*) FROM `articles`

  def create
    @article=Article.new(article_params)
    @article.user= current_user
   if @article.save
---
INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('one', 'one description', '2023-01-17 11:52:31.620826', '2023-01-17 11:52:31.620826', 29)

  def update

    if @article.update(article_params)
---
UPDATE `articles` SET `articles`.`description` = 'RoR basic concepts should be known to all.\r\nRoR is handy and can be used by all.\r\n', `articles`.`updated_at` = '2023-01-16 11:25:35.851472' WHERE `articles`.`id` = 45

    def destroy
      @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 42

    def find_by
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 54 LIMIT 1