app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email_id` = 'amansingh12@gmail.com' LIMIT 1
---
     def create
        user=User.find_by(email_id: params[:session][:email_id].downcase)