app/controllers/users_controller.rb

UPDATE `users` SET `users`.`updated_at` = '2023-01-12 07:58:48.364150', `users`.`password_digest` = '$2a$12$jVG4W1BpNzVYyOs3rHiwS..qS/algwzUb0ckmEyaXT6A7uzXC5RSG' WHERE `users`.`id` = 16
---
   def update
        if @user.update(user_params)

INSERT INTO `users` (`username`, `email_id`, `created_at`, `updated_at`, `password_digest`) VALUES ('shubhamraj', 'anuj.pal@gmail.com', '2023-01-12 06:16:06.254618', '2023-01-12 06:16:06.254618', '$2a$12$gHjjmNWKNUm5YVS37QBJVOdcv/P0/zCRYLhciG8Zv3NvgDYig0y/.')
---
    def create

        @user = User.new(user_params)
        if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 24 LIMIT 1
---
     def find_id
        @user = User.find(params[:id])